In [2]:
import pandas as pd
from glob import glob

In [3]:
datos = glob("empleados/*.csv")
datos

['empleados\\empleados_sucursal_A.csv',
 'empleados\\empleados_sucursal_B.csv',
 'empleados\\empleados_sucursal_C.csv',
 'empleados\\empleados_sucursal_D.csv',
 'empleados\\empleados_sucursal_E.csv',
 'empleados\\empleados_sucursal_F.csv',
 'empleados\\empleados_sucursal_G.csv',
 'empleados\\empleados_sucursal_H.csv',
 'empleados\\empleados_sucursal_I.csv',
 'empleados\\empleados_sucursal_J.csv',
 'empleados\\empleados_sucursal_K.csv',
 'empleados\\empleados_sucursal_L.csv',
 'empleados\\empleados_sucursal_M.csv',
 'empleados\\empleados_sucursal_N.csv',
 'empleados\\empleados_sucursal_O.csv']

In [4]:
dataset = []

for i in datos:
    df = pd.read_csv(i, usecols=['id', 'nombre'])
    dataset.append(df)
    
dfx = pd.concat(dataset)
dfx

            id    nombre
0   99-4094901  Clarisse
1   26-6370584  Ludovico
2   52-7669688  Hunfredo
3   09-6282213    Stacie
4   98-6095003    Alison
..         ...       ...
5   58-3268041   Kristal
6   90-3827618      Otho
7   78-9151673    Rupert
8   70-8330847    Dmitri
9   38-7030185   Jocelyn

[150 rows x 2 columns]

In [5]:
dfx.to_csv('empleados_id.csv', index=False)